depot/app/views/layouts/application.html.erb

SELECT 1 AS one FROM "line_items" WHERE "line_items"."cart_id" = $1 LIMIT $2  [["cart_id", 39], ["LIMIT", 1]]
---
              <% if @cart %>
                <%= hidden_div_if(@cart.line_items.empty?, id: 'cart') do %>