depot/app/controllers/carts_controller.rb

  def create
    @cart = Cart.new(cart_params)

    respond_to do |format|
      if @cart.save
---
INSERT INTO "carts" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2021-05-12 01:31:10.488074"], ["updated_at", "2021-05-12 01:31:10.488074"]]