depot/app/controllers/line_items_controller.rb

SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2021-05-11 08:51:46.105937"], ["updated_at", "2021-05-11 08:51:46.105937"]]
INSERT INTO "line_items" ("product_id", "cart_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["product_id", 1], ["cart_id", 30], ["created_at", "2021-05-12 07:20:30.167395"], ["updated_at", "2021-05-12 07:20:30.167395"]]
UPDATE "line_items" SET "updated_at" = $1, "quantity" = $2 WHERE "line_items"."id" = $3  [["updated_at", "2021-05-12 07:20:32.891781"], ["quantity", 2], ["id", 59]]
---
  def create
    # Find the Product with the same product_id as provided in params.
    product = Product.find_by(id: params[:product_id])

    # Add a line item of the product to the cart of the session.
    @line_item = @cart.add_product(product)

    respond_to do |format|
      if @line_item.save