depot/app/controllers/orders_controller.rb

  def show
    @orders = Order.find_by(id: params[:id])
---
SELECT "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @order = Order.new(order_params)
    @order.add_line_items_from_cart(@cart)

    respond_to do |format|
      if @order.save
        Cart.destroy(session[:cart_id])
---
INSERT INTO "carts" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2021-05-12 08:09:45.853296"], ["updated_at", "2021-05-12 08:09:45.853296"]]
INSERT INTO "orders" ("name", "address", "email", "pay_type", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "s"], ["address", "sds"], ["email", "s@s.com"], ["pay_type", 1], ["created_at", "2021-05-14 07:40:35.380266"], ["updated_at", "2021-05-14 07:40:35.380266"]]
DELETE FROM "carts" WHERE "carts"."id" = $1  [["id", 4]]

  def update
    @orders = get_all_orders_by_user
    respond_to do |format|
      if @order.update(order_params)
---
UPDATE "orders" SET "updated_at" = $1, "shipped" = $2 WHERE "orders"."id" = $3  [["updated_at", "2021-05-14 07:26:52.285497"], ["shipped", true], ["id", 8]]

    def ensure_cart_isnt_empty
      if @cart.line_items.empty?
---
SELECT 1 AS one FROM "line_items" WHERE "line_items"."cart_id" = $1 LIMIT $2  [["cart_id", 3], ["LIMIT", 1]]