depot/app/controllers/products_controller.rb

  def create
    @product = Product.new(product_params)
    @product.user_id = current_user.id

    respond_to do |format|
      if @product.save
---
INSERT INTO "products" ("title", "description", "image_url", "price", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def update
    respond_to do |format|
      if @product.update(product_params)
        set_products
        format.html { redirect_to @product, notice: "Product was successfully updated." }
        format.js { render 'update.js.erb'}
        format.json { render :show, status: :ok, location: @product }

        @products = Product.all
---
UPDATE "products" SET "description" = $1, "updated_at" = $2 WHERE "products"."id" = $3
SELECT "products".* FROM "products"