depot/app/controllers/store_controller.rb

  def index
    # Gets an array of products in alphabetical order of title.
    @products = Product.order(:title)
---
SELECT "products".* FROM "products" ORDER BY "products"."title" ASC