depot/app/views/orders/show.html.erb

<table id="items">
  <%= render(@order.ordered_line_items_of_user(current_user)) %>
---
SELECT "line_items".* FROM "line_items" WHERE "line_items"."order_id" = $1  [["order_id", 1]]