app/controllers/order_items_controller.rb

  def destroy
    @order_item.destroy
---
DELETE FROM "order_items" WHERE "order_items"."id" = $1  [["id", 980190962]]

    def set_order_item
      @order_item = OrderItem.find(params[:id])
---
SELECT "order_items".* FROM "order_items" WHERE "order_items"."id" = $1 LIMIT $2  [["id", 980190962], ["LIMIT", 1]]