app/controllers/sellers_controller.rb

  def index
    @sellers = Seller.all
---
SELECT "sellers".* FROM "sellers"

  def create
    @seller = Seller.new(seller_params)

    respond_to do |format|
      if @seller.save
---
INSERT INTO "sellers" ("username", "password", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["username", "MyString"], ["password", "MyString"], ["created_at", "2021-05-11 04:11:07.984873"], ["updated_at", "2021-05-11 04:11:07.984873"]]

  def destroy
    @seller.destroy
---
DELETE FROM "sellers" WHERE "sellers"."id" = $1  [["id", 2]]

    def set_seller
      @seller = Seller.find(params[:id])
---
SELECT "sellers".* FROM "sellers" WHERE "sellers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]