old/app/controllers/cart_items_controller.rb

  def destroy
    @cart_item.destroy
---
DELETE FROM "cart_items" WHERE "cart_items"."id" = $1  [["id", 980190962]]

    def set_cart_item
      @cart_item = CartItem.find(params[:id])
---
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."id" = $1 LIMIT $2  [["id", 980190962], ["LIMIT", 1]]